package lesson_1;

//3. Написать программу осуществляющую решение линейного уравнения ax + b = 0. a и b задаете в программе, х выводите на экран.

public class Task2 {

    public static void main(String[] args) {

        double a = 5;
        double b = 9;

        double x = -b / a;

        System.out.println("x равен: " + x);
    }

}
