package lesson_2;

//8. Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….

public class Task8 {

    public static void main(String[] args) {

        for (int x = 90; x >=0; x -= 5) {
            System.out.println(x);
        }

    }

}
